import { INamedEntity } from '@lib/types';

// appl statuses
export const applStatuses: INamedEntity[] = [
  {
    id: '168062972',
    name: 'Исполнен',
  },
  {
    id: '168062973',
    name: 'Принят к исполнению',
  },
  {
    id: '168062974',
    name: 'Отказано',
  },
  {
    id: '168062975',
    name: 'Доработан',
  },
  {
    id: '168062976',
    name: 'На доработке',
  },
  {
    id: '168062977',
    name: 'На доработку',
  },
  {
    id: '168062978',
    name: 'Утвержден',
  },
  {
    id: '168062979',
    name: 'Согласован инженерной службой',
  },
  {
    id: '168062980',
    name: 'Предварительно согласован',
  },
  {
    id: '168062981',
    name: 'На проверке',
  },
  {
    id: '168062982',
    name: 'Отправлен на проверку',
  },
  {
    id: '168062983',
    name: 'Введен',
  },
  {
    id: '169207734',
    name: 'Возвращен инженерной службой',
  },
  {
    id: '169207735',
    name: 'На проверке (инж. служба)',
  },
  {
    id: '174228882',
    name: 'Оплачен',
  },
  {
    id: '172369696',
    name: 'Исполняется',
  },
  {
    id: '174228883',
    name: 'Готов к оплате',
  },
  {
    id: '174228933',
    name: 'Проверен',
  },
];
